iTower_20__GIS_Управление_пространственными_данными/src/Documents/УБХЗапросНаРазмещениеОборудования/УБХЗапросНаРазмещениеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБХЗапросНаРазмещениеОборудования</name>
  <registerRecords>InformationRegister.УБХЗапросыКлиентовПБК</registerRecords>
  <registerRecords>InformationRegister.УБХОборудованиеОбъектаПБК</registerRecords>
  <attributes>
    <name>ТекущаяВерсияЗапроса</name>
    <type>
      <types>DocumentRef.УБХВерсияЗапросаНаРазмещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.УБХСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.УБХТипыЗапросовРазмещения</types>
    </type>
  </attributes>
  <attributes>
    <name>АМС</name>
    <type>
      <types>CatalogRef.УБХАМС</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентПБК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.УБХПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗапросаНаРазмещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпециальнаяСкидкаСогласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСогласованияСпецСкидки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.УБХВидыТарифовРазмещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.УБХТарифыРазмещения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АМСЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЗапроса</name>
    <type>
      <types>DefinedType.УБХКоординаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЗапроса</name>
    <type>
      <types>DefinedType.УБХКоординаты</types>
    </type>
  </attributes>
  <attributes>
    <name>БСКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеПитания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикЭлектроэнергии</name>
    <type>
      <types>EnumRef.УБХПоставщикиЭлектроэнергии</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЭлектроснабжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДействия</name>
    <type>
      <types>EnumRef.УБХТипыДействияВЛЭС</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеАренднойПлаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАрендатора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксВысотаПодвеса</name>
    <type>
      <types>DefinedType.УБХВысота</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьСтандартныйОбъемРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьРасширенныйОбъемРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АнтенныСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтейнерСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсацияЗаЭлектроэнергию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаЗаОбщийОбъемПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиЗаОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыраженияРасчетаНаценка</name>
    <type>
      <types>EnumRef.УБХВидыВыраженийРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыраженияРасчетаСкидка</name>
    <type>
      <types>EnumRef.УБХВидыВыраженийРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецСкидка</name>
    <comment>Специальная скидка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСпецСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРазмещенияИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяНаценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяСпецСкидка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьОборудования</name>
    <attributes>
      <name>ТипРазмещенияВКонтейнере</name>
      <type>
        <types>EnumRef.УБХТипыРазмещенийВКонтейнере</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаОборудования</name>
      <type>
        <types>CatalogRef.УБХОборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.УБХСтатусы</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРазмещения</name>
      <type>
        <types>EnumRef.УБХГруппыРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяВысотаПодвеса</name>
      <type>
        <types>DefinedType.УБХВысота</types>
      </type>
    </attributes>
    <attributes>
      <name>Габариты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>38</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диаметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Азимут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаКабеля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНитокКабеля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМодулей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВысотаПодвеса</name>
      <type>
        <types>DefinedType.УБХВысота</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/УБХТипыЗапросовРазмещения/УБХТипыЗапросовРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБХТипыЗапросовРазмещения</name>
  <enumValues>
    <name>НовоеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>Демонтаж</name>
  </enumValues>
  <enumValues>
    <name>Модернизация</name>
  </enumValues>
  <enumValues>
    <name>СовместноеИспользование</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Documents/УБХЗапросНаРазмещениеОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяВерсияЗапроса) Тогда
		ВерсияОбъект = Документы.УБХВерсияЗапросаНаРазмещение.СоздатьДокумент();
		ВерсияОбъект.Дата = ТекущаяДата();
		ВерсияОбъект.Записать();
		ТекущаяВерсияЗапроса = ВерсияОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	// Инициализация дополнительных свойств для проведения документа
	УБХПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.УБХЗапросНаРазмещениеОборудования.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	УБХЗапросыРазмещения.ОтразитьЗапросыКлиентовПБК(ДополнительныеСвойства, Движения, Отказ);
	УБХЗапросыРазмещения.ОтразитьОборудованиеОбъектаПБК(ДополнительныеСвойства, Движения, Отказ);
	
	// ЗАПОЛНИТЬ ВЕРСИЮ ЗАПРОСА
	УБХЗапросыРазмещения.АктуализироватьДанныеВерсииЗапроса(ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УБХВерсияЗапросаНаРазмещение") Тогда
		
		ЗаполнитьПоВерсииЗапросаНаРазмещение(ДанныеЗаполнения, ДанныеЗаполнения);
		
	КонецЕсли;

	Если ЭтотОбъект.ЭтоНовый() Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоВерсииЗапросаНаРазмещение(Знач ДокументОснование, ДанныеЗаполнения)
	
	ДанныеЗаполнения = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсияЗапросаНаРазмещение.ПереченьОборудования.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ТипРазмещенияВКонтейнере КАК ТипРазмещенияВКонтейнере,
		|		ЕдиницаОборудования КАК ЕдиницаОборудования,
		|		Статус КАК Статус,
		|		ГруппаРазмещения КАК ГруппаРазмещения,
		|		ПлановаяВысотаПодвеса КАК ПлановаяВысотаПодвеса,
		|		Габариты КАК Габариты,
		|		Диаметр КАК Диаметр,
		|		Площадь КАК Площадь,
		|		Азимут КАК Азимут,
		|		ДлинаКабеля КАК ДлинаКабеля,
		|		КоличествоНитокКабеля КАК КоличествоНитокКабеля,
		|		НомерМеста КАК НомерМеста,
		|		КоличествоМодулей КАК КоличествоМодулей
		|	) КАК ПереченьОборудования,
		|	ВерсияЗапросаНаРазмещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УБХВерсияЗапросаНаРазмещение КАК ВерсияЗапросаНаРазмещение
		|ГДЕ
		|	ВерсияЗапросаНаРазмещение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ВыборкаДетальныеЗаписи.ПереченьОборудования.Пустой() Тогда 
			ПереченьОборудования.Загрузить(ВыборкаДетальныеЗаписи.ПереченьОборудования.Выгрузить());
		Иначе
			ПереченьОборудования.Очистить();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры	

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	Статус 		= Справочники.УБХУБХСтатусыРазмещенияОбъектаПБК.Черновик;
	ТипЗапроса 	= Перечисления.УБХТипыЗапросовРазмещения.НовоеРазмещение;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
